Конфигурация/InformationRegisters/ОснованияВнесенияВПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОснованияВнесенияВПеречень</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыИзмененийПеречней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыИзмененийПеречней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/ОснованияВнесенияВПеречень/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПоследовательностьСтатусов(Отказ);
	
КонецПроцедуры

Функция ПроверитьПоследовательностьСтатусов(Отказ)

	КолонкиИзмерений = "Организация, Объект, ВидПеречня";
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
		
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, КолонкиИзмерений);
		
		ТаблицаОтбора = ЭтотОбъект.ВыгрузитьКолонки(КолонкиИзмерений);
		ЗаполнитьЗначенияСвойств(ТаблицаОтбора.Добавить(), ЗначенияРеквизитов);
		
	Иначе
		
		ТаблицаОтбора = ЭтотОбъект.Выгрузить(, КолонкиИзмерений);
		ТаблицаОтбора.Свернуть(КолонкиИзмерений);
		
	КонецЕсли; 
		
	#Область Текст_запроса_контроля_последовательности_изменений
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтбора.Организация КАК Организация,
		|	ТаблицаОтбора.Объект КАК Объект,
		|	ТаблицаОтбора.ВидПеречня КАК ВидПеречня
		|ПОМЕСТИТЬ _ТаблицаОтбора
		|ИЗ
		|	&ТаблицаОтбора КАК ТаблицаОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОснованияВнесенияВПеречень.Период КАК Период,
		|	ОснованияВнесенияВПеречень.Организация КАК Организация,
		|	ОснованияВнесенияВПеречень.Объект КАК Объект,
		|	ОснованияВнесенияВПеречень.ВидПеречня КАК ВидПеречня,
		|	ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения КАК ВидИзменения,
		|	ОснованияВнесенияВПеречень.Основание КАК Основание
		|ПОМЕСТИТЬ _ОснованияВнесенияВПеречень
		|ИЗ
		|	РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВнесенияВПеречень
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаОтбора КАК _ТаблицаОтбора
		|		ПО ОснованияВнесенияВПеречень.Организация = _ТаблицаОтбора.Организация
		|			И ОснованияВнесенияВПеречень.Объект = _ТаблицаОтбора.Объект
		|			И ОснованияВнесенияВПеречень.ВидПеречня = _ТаблицаОтбора.ВидПеречня
		|			И (ОснованияВнесенияВПеречень.Активность)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
		|		ПО ОснованияВнесенияВПеречень.Основание = ВнесениеИзмененийВоВнутреннийПеречень.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОснованияВнесенияВПеречень.Организация КАК Организация,
		|	_ОснованияВнесенияВПеречень.Объект КАК Объект,
		|	_ОснованияВнесенияВПеречень.ВидПеречня КАК ВидПеречня,
		|	_ОснованияВнесенияВПеречень.Период КАК Дата,
		|	МАКСИМУМ(_ОснованияВнесенияВПереченьПредыдущий.Период) КАК ПредыдущаяДата
		|ПОМЕСТИТЬ _Периоды
		|ИЗ
		|	_ОснованияВнесенияВПеречень КАК _ОснованияВнесенияВПеречень
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОснованияВнесенияВПеречень КАК _ОснованияВнесенияВПереченьПредыдущий
		|		ПО _ОснованияВнесенияВПеречень.Период > _ОснованияВнесенияВПереченьПредыдущий.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОснованияВнесенияВПеречень.Период,
		|	_ОснованияВнесенияВПеречень.Организация,
		|	_ОснованияВнесенияВПеречень.Объект,
		|	_ОснованияВнесенияВПеречень.ВидПеречня
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущийПериод.Период КАК Дата,
		|	ТекущийПериод.Организация КАК Организация,
		|	ТекущийПериод.Объект КАК Объект,
		|	ТекущийПериод.ВидПеречня КАК ВидПеречня,
		|	ТекущийПериод.ВидИзменения КАК ТекущийСтатус,
		|	ПредыдующийПериод.Период КАК ПредыдущаяДата,
		|	ПредыдующийПериод.ВидИзменения КАК ПредыдущийСтатус,
		|	ТекущийПериод.Основание КАК Основание
		|ИЗ
		|	_Периоды КАК _Периоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОснованияВнесенияВПеречень КАК ТекущийПериод
		|		ПО _Периоды.Дата = ТекущийПериод.Период
		|			И _Периоды.Организация = ТекущийПериод.Организация
		|			И _Периоды.Объект = ТекущийПериод.Объект
		|			И _Периоды.ВидПеречня = ТекущийПериод.ВидПеречня
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОснованияВнесенияВПеречень КАК ПредыдующийПериод
		|		ПО _Периоды.ПредыдущаяДата = ПредыдующийПериод.Период
		|			И _Периоды.Организация = ПредыдующийПериод.Организация
		|			И _Периоды.Объект = ПредыдующийПериод.Объект
		|			И _Периоды.ВидПеречня = ПредыдующийПериод.ВидПеречня
		|ГДЕ
		|	(ТекущийПериод.ВидИзменения В (ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Изменение), ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение))
		|				И ЕСТЬNULL(ПредыдующийПериод.ВидИзменения, ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение)) = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение)
		|			ИЛИ ТекущийПериод.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Включение)
		|				И ЕСТЬNULL(ПредыдующийПериод.ВидИзменения, ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение)) <> ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение))";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщение = "Нарушена последовательность ввода документов: ";
		
		Если Выборка.ПредыдущийСтатус = Перечисления.ВидыИзмененийПеречней.Включение Тогда
			// Два включения подряд
			Сообщение = Сообщение + "'%1' включен в перечень '%2' по организации '%3' " 
				+ Формат(Выборка.ПредыдущаяДата, "ДФ=dd.MM.yyyy") + " и "
				+ Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Иначе
			// Изменение или исключение до включения
			Сообщение = Сообщение + "'%1' не включен в перечень '%2' по организации '%3' на " 
				+ Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Сообщение = СтрШаблон(Сообщение, Выборка.Объект, Выборка.ВидПеречня, Выборка.Организация);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, Выборка.Основание,,, Отказ); 
	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
